@rileykarson above is for fails (#1) . From the log, I do not see addInstance() is called. 

here is the plan & apply for #2 in creation.

```
  # google_compute_instance_group.staging_group will be created
  + resource "google_compute_instance_group" "staging_group" {
      + id        = (known after apply)
      + instances = (known after apply)
      + name      = "issue14157-instance-group"
      + network   = (known after apply)
      + project   = (known after apply)
      + self_link = (known after apply)
      + size      = (known after apply)
      + zone      = "us-central1-c"

      + named_port {
          + name = "http"
          + port = 8080
        }
      + named_port {
          + name = "https"
          + port = 8443
        }
    }
```

```
 POST /compute/v1/projects/myproject/zones/us-central1-c/instanceGroups/issue14157-instance-group/addInstances?alt=json&prettyPrint=false HTTP/1.1
 Host: compute.googleapis.com
 {
  "instances": [
   {
    "instance": "https://compute.googleapis.com/compute/v1/projects/myproject/zones/us-central1-c/instances/issue14157-vm2"
   },
   {
    "instance": "https://compute.googleapis.com/compute/v1/projects/myproject/zones/us-central1-c/instances/issue14157-vm1"
  }
 ]
}
```